In [7]:
import pandas as pd
import numpy as np

In [8]:
df = pd.read_excel("test.xlsx", sheet_name=0)
df

,Unnamed: 0,First Name,Last Name,Gender,Country,Age,Date,Id
0,1,Dulce,Abril,Female,United States,32,15/10/2017,1562
1,2,Mara,Hashimoto,Female,Great Britain,25,16/08/2016,1582
2,3,Philip,Gent,Male,France,36,21/05/2015,2587
3,4,Kathleen,Hanner,Female,United States,25,15/10/2017,3549
4,5,Nereida,Magwood,Female,United States,58,16/08/2016,2468
...,...,...,...,...,...,...,...,...
4995,4996,Roma,Lafollette,Female,United States,34,15/10/2017,2654
4996,4997,Felisa,Cail,Female,United States,28,16/08/2016,6525
4997,4998,Demetria,Abbey,Female,United States,32,21/05/2015,3265
4998,4999,Jeromy,Danz,Male,United States,39,15/10/2017,3265
4999,5000,Rasheeda,Alkire,Female,United States,29,16/08/2016,6125

In [14]:
df.rename({"Unnamed: 0": "Test"}, axis=1, inplace=True)
df.drop(columns=['Test'], inplace=True)

In [28]:
df[(df['Country'] != 'United States')]

     First Name  Last Name  Gender        Country  Age        Date    Id
1          Mara  Hashimoto  Female  Great Britain   25  16/08/2016  1582
2        Philip       Gent    Male         France   36  21/05/2015  2587
6          Etta       Hurn  Female  Great Britain   56  15/10/2017  3598
9        Fallon    Winward  Female  Great Britain   28  16/08/2016  5486
10      Arcelia     Bouska  Female  Great Britain   39  21/05/2015  1258
...         ...        ...     ...            ...  ...         ...   ...
4981     Stasia     Becker  Female  Great Britain   34  16/08/2016  7521
4982       Jona    Grindle  Female  Great Britain   26  21/05/2015  6458
4983      Judie   Claywell  Female         France   35  16/08/2016  7569
4986     Kelsie    Wachtel  Female         France   27  16/08/2016  8642
4992      Angel      Sanor    Male         France   24  15/10/2017  3259

[2600 rows x 7 columns]

In [35]:
df['First Name'].convert_dtypes(convert_string=True)

df.dtypes

dtype('O')